[
    {
        "id": "dtail-spaces",
        "card": true,
        "title": "Dtail Spaces",
        "language": "C++",
        "engine": "Unreal",
        "role": "Unreal Software Engineer",
        "duration": "5m+",
        "datetime": "2025",
        "minisrc": "res/bg_mini_dtail_spaces.png",
        "banner": "res/banner_dtail_spaces.png",
        "type": "PixelPool",
        "description": "Dtail Spaces is a 3D application built with Unreal Engine 5 that allows fashion brands to create virtual store environments with fixtures and products for presentations, enabling users to virtually walk customers through customizable showrooms",
        "longdescription": "Dtail Spaces is an interactive 3D application that enables fashion brands to create hyperrealistic virtual showrooms by dragging and dropping fixtures and products into customizable retail spaces. Users can showcase collections with 360-degree product views and detailed zoom capabilities, providing an engaging alternative to traditional 2D presentations for both B2B buyers and internal merchandising teams.",
        "work": [
            {
                "title": "Refactoring/Optimization",
                "description": "Currently we're in the process of refactoring various legacy code chunks to be easier to maintain. "
            },
            {
                "title": "Feature Development",
                "description": "Developing new features for the application (NDA)"
            }
        ],
        "tags": [
            "gameplay",
            "refactoring",
            "optimization"
        ],
        "socials": [
            {
                "info": "Dtail.com",
                "url": "https://www.dtail.com/",
                "icon": "res/ico_site.png"
            }
        ],
        "screenshots": [
            {
                "src": "res/projects/dtail/ss_dtail_1.png",
                "alt": "Dtail Spaces Screenshot 1"
            },
            {
                "src": "res/projects/dtail/ss_dtail_2.jpg",
                "alt": "Dtail Spaces Screenshot 2"
            },
            {
                "src": "res/projects/dtail/ss_dtail_3.png",
                "alt": "Dtail Spaces Screenshot 3"
            }
        ]
    },
    {
        "id": "motherlode-tycoon",
        "card": true,
        "title": "Motherlode Tycoon",
        "language": "Verse",
        "engine": "UEFN",
        "role": "Verse Programmer",
        "duration": "2m",
        "datetime": "2025",
        "minisrc": "res/bg_mini_motherlode_tycoon.png",
        "banner": "res/banner_motherlode_tycoon.png",
        "type": "Zloppy Games",
        "description": "A take on the classic tycoon genre in Fortnite Creative; we try to aim for a more fun and engaging experience that's just not catered to ensuring children get hooked on the game.",
        "longdescription": "",
        "work": [
            {
                "title": "Core Design",
                "description": "Together with my friend, we designed the core gameplay mechanics and systems. E.g. the ability to own plots, build and upgrade structures, display resources, have 3d world UI, etc"
            },
            {
                "title": "Gathering",
                "description": "Created responsive and interesting feedback tothe player when gathering and ensuring this information is displayed in a clear and concise manner. The player can gather resources from the world, which are then used to build and upgrade structures."
            },
            {
                "title": "Cosmetics",
                "description": "Created a system where players can purchase cosmetics for their characters with persistence, allowing them to customize their character's appearance. This includes clothing, accessories, and other visual elements."
            },
            {
                "title": "Co-op Projects",
                "description": "Created a system where players can work together on projects, such as building structures or gathering resources. This encourages teamwork and collaboration between players."
            },
            {
                "title": "Teleportation, Barriers and more",
                "description": "Created a system where players can teleport to different locations in the world, allowing for quick travel and exploration. This system also includes barriers to prevent players from accessing certain areas until they have completed certain objectives or reached a certain level of progress."
            },
            {
                "title": "Gifts",
                "description": "Created a system where players can receive rewards for completing objectives or reaching certain milestones or simply waiting."
            },
            {
                "title": "Level Design",
                "description": "Designed the core level of the game, including the layout, the resource spawners, the player plots, and the overall look and feel of the game."
            },
            {
                "title": "and more...",
                "description": "Experience many other exciting activities and features."
            }
            
        ],
        "tags": [
            "gameplay",
            "design"
        ],
        "socials": [
            {
                "info": "fortnite.gg",
                "url": "https://fortnite.gg/island?code=3579-7551-5955",
                "icon": "res/ico_site.png"
            }
        ],
        "screenshots": [
            {
                "src": "res/projects/motherlode/ss_motherlode_1.png",
                "alt": "Motherlode Tycoon Screenshot 1"
            },
            {
                "src": "res/projects/motherlode/ss_motherlode_2.png",
                "alt": "Motherlode Tycoon Screenshot 2"
            },
            {
                "src": "res/projects/motherlode/ss_motherlode_3.png",
                "alt": "Motherlode Tycoon Screenshot 3"
            }
        ]
    },
    {
        "id": "ember-sword",
        "card": true,
        "title": "Ember Sword",
        "language": "C++",
        "engine": "Radiance",
        "role": "Gameplay Programmer",
        "duration": "3y+",
        "datetime": "2021",
        "minisrc": "res/bg_mini_embersword.png",
        "banner": "res/banner_embersword.png",
        "type": "BSS",
        "description": "An open world sandbox MMORPG by Bright Star Studios. ",
        "longdescription": "Ember Sword is a cross-platform player-centric Free-to-Play fantasy MMORPG. Players can own, control, and evolve their land, and can trade their assets with other players. The game is built on the Radiance Engine, a custom-built engine by Bright Star Studios.",
        "work": [
            {
                "title": "Exploration",
                "description": "Worked on creating the vast open-world of Ember Sword featuring PvP zones, Player owned plots, questing and creature spawners, patrolling creatures. Including work on the instanced gameplay mechanics in the Ultra Deep dungeon."
            },
            {
                "title": "Trade Packs",
                "description": "Created the Trade Pack system which allows players to gather resources, craft them into trade packs and deliver them to other locations for a profit. This system is designed to be a player-driven economy system. These trade packs can be stolen by other players, creating a risk vs reward system."
            },
            {
                "title": "Combat",
                "description": "Assisted in setting up the Ability system and iterating on this design. Ember Sword uses a custom built timeline system where we can assign triggers to times and have various things happen simultaneously on the client and server."
            },
            {
                "title": "Gameplay Data",
                "description": "Created the ValueBag which is an internal term for a data container we can use to store any kind of data we can use for our abilities, behaviors, keep track of instanced data, etc."
            },
            {
                "title": "Creature Behaviors",
                "description": "Created a custom Behavior Tree solution with Engine visualizer to see real-time data of all creatures and their decisionmaking in action. Both logic is used for all creatures and bosses: for example boars are able to encircle a player, bandit javelin throwsers will try to keep their distance and throw javelins, and the boss in the Ultra Deep dungeon has a unique set of abilities and phases.."
            },
            {
                "title": "Gathering",
                "description": "Created the first iteration of the gathering system, this got later overhauled, but the initial system was brought back and enhanced greatly."
            },
            {
                "title": "Crafting",
                "description": "Created the serverside mechanics for Crafting in Embersword. You can collect resources, find interactive crafting tables in the world of of Ember Sword and use thee to make various items"
            },
            {
                "title": "Quests",
                "description": "Created a questing system which we designed together with my gameplay lead (from World of Warcraft), it's designed to be performant and easy to add new quest objectives. "
            },
            {
                "title": "Player Interaction",
                "description": "Created PvP as game mechanic, worked on chatting, supported on parties and created the Emote system"
            },
            {
                "title": "Boss Battles",
                "description": "Each boss in Ember Sword has custom boss mechanics. For example Canavar is a boss which uses close-range abilities based on the combatants positions and uses a charge ability to close the gap. Shauk is a special boss which returns to the center of an arena to do specific abilities which are all designed for a circular arena. This boss has 2 phases where each attack is greatly enhanced."
            },
            {
                "title": "and more...",
                "description": "Experience many other exciting activities and features."
            }
        ],
        "tags": [
            "networking",
            "gameplay"
        ],
        "socials": [
            {
                "info": "embersword.com",
                "url": "https://embersword.com",
                "icon": "res/ico_embersword.png"
            }
        ],
        "videos": [
            {
                "src": "res/projects/embersword/vid_embersword_1.webm",
                "alt": "Ember Sword Gameplay 1"
            },
            {
                "src": "res/projects/embersword/vid_embersword_2.webm",
                "alt": "Ember Sword Gameplay 2"
            },
            {
                "src": "res/projects/embersword/vid_embersword_3.webm",
                "alt": "Ember Sword Gameplay 3"
            },
            {
                "src": "res/projects/embersword/vid_embersword_4.webm",
                "alt": "Ember Sword Gameplay 4"
            }
        ],
        "screenshots": [
            {
                "src": "res/projects/embersword/ss_embersword_4.png",
                "alt": "Ember Sword Screenshot 4"
            },
            {
                "src": "res/projects/embersword/ss_embersword_1.png",
                "alt": "Ember Sword Screenshot 1"
            },
            {
                "src": "res/projects/embersword/ss_embersword_2.png",
                "alt": "Ember Sword Screenshot 2"
            },
            {
                "src": "res/projects/embersword/ss_embersword_3.png",
                "alt": "Ember Sword Screenshot 3"
            }
        ]
    },
    {
        "id": "farmion",
        "card": true,
        "title": "Farmion",
        "language": "C++",
        "engine": "Unreal",
        "role": "Game Programmer",
        "duration": "6m",
        "datetime": "2022",
        "minisrc": "res/bg_mini_farmion.png",
        "banner": "res/banner_farmion.png",
        "type": "BH",
        "description": "A time-management wizard-themed farming sim, including cooperative play!",
        "longdescription": "This game is a solo dev production, various art is from the Unreal Marketplace, some made myself. Farmion is a time-management wizard-themed farming sim, including cooperative play!",
        "work": [
            {
                "title": "A cycle a day",
                "description": "Farmion is designed to be a farming game where time management is of the essence. You have limited day time and every day is a 'Tick' in gameplay Elements. You have to manage your time wisely to get the most out of your day. Forget to water crops? They will die. Left your cows outside? They will .. vanish! Etc - Also, you will die too if you're outside during the Cycle transition."
            },
            {
                "title": "Physics Fun",
                "description": "Introduced a system where you can hold all objects, throw them around in a reliable manner so real physics is not in play, only the illusion of it. This system is used for the player to interact with the world and other players in a fun and engaging way."
            },
            {
                "title": "Stage-Based Farming",
                "description": "Created a system where you plant crops, they last for X days, require Y water, can be affected by Bees to grow faster and attacked by hostile Bugs"
            },
            {
                "title": "Upgrades, Upgrades everywhere!",
                "description": "Made a System where you can purchase various upgrades in game such as a Pantry to store goods, an Animal Barn to properly 'store' your Animals, a greenhouse and lots more!"
            },
            {
                "title": "Multiplayer",
                "description": "Games are a joy to be played together, so Farmion is carefully created keeping 1-6 players in mind."
            },
            {
                "title": "House & Character Customization",
                "description": "Created a system where you can re-design your Magical mansion as you are awaiting the night pass."
            },
            {
                "title": "Cheese System",
                "description": "Create cheese using your anima's milk, curd them, age them in particular environments and sell them for a great profit..! Or ruin your cheese!"
            },
            {
                "title": "Buffs System",
                "description": "Any item you can hold, you can throw in the Giant all-eating Statue! Acquire unique buffs for a limited time based on what you throw out. Recycling has never been so productive!"
            },
            {
                "title": "Transportation and Carts",
                "description": "As you can only hold a single item, you can use Carts to hold your items and drag around a cart instead."
            },
            {
                "title": "and more...",
                "description": "Experience many other exciting activities and features."
            }
        ],
        "tags": [
            "networking",
            "gameplay"
        ],
        "socials": [
            {
                "info": "link.tree",
                "url": "https://linktr.ee/baerandhoggo",
                "icon": "res/ico_farmion.png"
            },
            {
                "info": "discord",
                "url": "https://discord.gg/7X7gYf93ph",
                "icon": "res/ico_discord.png"
            }
        ],
        "screenshots": [
            {
                "src": "res/projects/farmion/ss_farmion_11.png",
                "alt": "S11"
            },
            {
                "src": "res/projects/farmion/ss_farmion_12.png",
                "alt": "S12 - Steam"
            },
            {
                "src": "res/projects/farmion/ss_farmion_01.png",
                "alt": "S1"
            },
            {
                "src": "res/projects/farmion/ss_farmion_02.png",
                "alt": "S2"
            },
            {
                "src": "res/projects/farmion/ss_farmion_03.png",
                "alt": "S3"
            },
            {
                "src": "res/projects/farmion/ss_farmion_04.png",
                "alt": "S4"
            },
            {
                "src": "res/projects/farmion/ss_farmion_05.png",
                "alt": "S5"
            },
            {
                "src": "res/projects/farmion/ss_farmion_06.png",
                "alt": "S6"
            },
            {
                "src": "res/projects/farmion/ss_farmion_07.png",
                "alt": "S7"
            },
            {
                "src": "res/projects/farmion/ss_farmion_08.png",
                "alt": "S8"
            },
            {
                "src": "res/projects/farmion/ss_farmion_09.png",
                "alt": "S9"
            },
            {
                "src": "res/projects/farmion/ss_farmion_10.png",
                "alt": "S10"
            }
        ],
        "videos": [
            {
                "src": "res/projects/farmion/vid_farmion_01.mp4",
                "alt": "V1"
            }
        ]
    },
    {
        "id": "radiance",
        "card": true,
        "title": "Radiance Engine",
        "language": "C++",
        "engine": "Radiance",
        "role": "Gameplay Programmer",
        "duration": "2y+",
        "datetime": "2021",
        "minisrc": "res/bg_mini_radiance.png",
        "banner": "res/banner_radiance.png",
        "type": "BSS",
        "description": "The creation of a MMORPG web-based game engine.",
        "longdescription": "Radiance is a custom-built engine by Bright Star Studios, built for the MMORPG Ember Sword. It is a web-based engine, allowing for cross-platform play.",
        "work": [
            {
                "title": "Unity <-> Radiance Sync",
                "description": "Created a system where Unity can sync with Radiance, allowing for a transition from Unity to Radiance during our development period between using the two engines. This ensured that Level Design and World Design could continue on Unity until it could be done in similar capabilities in Radiance."
            },
            {
                "title": "Animation State Machine Editor",
                "description": "Created an Animation State Machine Editor in Radiance, allowing designers to view animation states and their transitions."
            },
            {
                "title": "Behavior Tree Editor",
                "description": "To support the creation of AI behaviors, I created a Behavior Tree Editor in the Radiance Engine. This editor allows designers to create and modify AI behaviors in a visual way."
            },
            {
                "title": "Item Editor",
                "description": "Created an Item Editor in Radiance, allowing designers to create and modify items in the game."
            },
            {
                "title": "Crafting Recipe Editor",
                "description": "Created a Crafting Recipe Editor in Radiance, allowing designers to create and modify crafting recipes in the game. Both this and the Item Editor derived from a Base Editor Tool I created."
            }
        ],
        "tags": [
            "tools",
            "engine"
        ],
        "socials": [],
        "screenshots": [
            {
                "src": "res/projects/radiance/ss_radiance_05.png",
                "alt": "S5"
            },
            {
                "src": "res/projects/radiance/ss_radiance_01.png",
                "alt": "S1"
            },
            {
                "src": "res/projects/radiance/ss_radiance_02.png",
                "alt": "S2"
            },
            {
                "src": "res/projects/radiance/ss_radiance_03.png",
                "alt": "S3"
            },
            {
                "src": "res/projects/radiance/ss_radiance_04.png",
                "alt": "S4"
            }
        ]
    },
    
    {
        "id": "bitfarers",
        "card": true,
        "title": "BitFarers",
        "language": "C++",
        "engine": "Unreal",
        "role": "Game Programmer",
        "duration": "4m",
        "datetime": "2021",
        "minisrc": "res/bg_mini_bitfarers.png",
        "banner": "res/banner_bitfarers.png",
        "type": "Hobby",
        "description": "A co-op dungeon running game with a theme traversal twist.",
        "longdescription": "A theme-traversal co-op FPS game with roguelike elements, players travel through different themed dungeons, each with their own unique mechanics and enemies and upgrade their characters as they progress.",
        "work": [
            {
                "title": "Seamless co-op",
                "description": "Created a system where in Multiplayer scenarios, you can seamlessly travel through various dungeon levels and you'll end up at the lobby together."
            },
            {
                "title": "First Person Gunplay",
                "description": "Worked on the weapon mechanics including: shooting, reloading, weapon switching, aiming down sights and more. I wanted muzzles, projectiles and everything to be accurate for all players and feel right. For this it was important to have a proper replication system in place to ensure all players see proper third-person muzzle flashes from other players, etc."
            },
            {
                "title": "Loot, loot and (destructable) more loot",
                "description": "Implemented a system where you can define loot tables for breakables, enemies and chests."
            },
            {
                "title": "User Interface",
                "description": "Created unique UI for the game: Buffs, Debuffs, Health, Ammo, Weapon, what ammo you have etc."
            }
        ],
        "tags": [
            "networking",
            "gameplay"
        ],
        "socials": [],
        "screenshots": [
            {
                "src": "res/projects/bitfarers/ss_bitfarers_01.png",
                "alt": "S1"
            },
            {
                "src": "res/projects/bitfarers/ss_bitfarers_02.png",
                "alt": "S2"
            }
        ],
        "videos": [
            {
                "src": "res/projects/bitfarers/vid_bitfarers_01.mp4",
                "alt": "V1"
            },
            {
                "src": "res/projects/bitfarers/vid_bitfarers_02.mp4",
                "alt": "V1"
            },
            {
                "src": "res/projects/bitfarers/vid_bitfarers_03.mp4",
                "alt": "V1"
            },
            {
                "src": "res/projects/bitfarers/vid_bitfarers_04.mp4",
                "alt": "V1"
            }
        ]
    },
    {
        "id": "idle-cards",
        "card": true,
        "title": "IdleCards",
        "language": "C#",
        "engine": "Unity",
        "role": "Game Programmer",
        "duration": "4m",
        "datetime": "2020",
        "minisrc": "res/bg_mini_idlecards.png",
        "banner": "res/banner_idlecards.png",
        "type": "Hobby",
        "description": "An idle game with card-based combat for Phones",
        "longdescription": "An idle game at the core of the game, with the added features of an active card battling system. Players can collect cards, upgrade them, and use them in battles to progress through the game.",
        "work": [
            {
                "title": "Card Battling vs AI",
                "description": "Created a Turn-based card battling system where you can battle against AI opponents. The AI has an algorithm to determine the best move based on the current state of the game."
            },
            {
                "title": "Offline Idle Progression",
                "description": "Created a System where it simulates the game while you're offline, so you can come back to a lot of progress. Get that dopamine hit on big numbers appearing."
            },
            {
                "title": "Unity UI Implementations",
                "description": "Worked on 'Fake 3D' Card Elements which you can play on boards; Worked on 2D user interfaces to buy buildings, upgrade them, etc."
            }
        ],
        "tags": [
            "android",
            "gameplay"
        ],
        "socials": [],
        "screenshots": [
            {
                "src": "res/projects/idlecards/ss_idlecards_02.png",
                "alt": "S2"
            },
            {
                "src": "res/projects/idlecards/ss_idlecards_03.png",
                "alt": "S3"
            },
            {
                "src": "res/projects/idlecards/ss_idlecards_01.png",
                "alt": "S1"
            }
        ],
        "videos": [
            {
                "src": "res/projects/idlecards/vid_idlecards_01.mp4",
                "alt": "V1"
            },
            {
                "src": "res/projects/idlecards/vid_idlecards_02.mp4",
                "alt": "V1"
            }
        ]
    },
    {
        "id": "andromeda-resonance",
        "card": true,
        "title": "Andromeda Resonance",
        "language": "C++",
        "engine": "Unreal",
        "role": "Game Programmer",
        "duration": "4m",
        "datetime": "2019",
        "minisrc": "res/bg_mini_andromedaresonance.png",
        "banner": "res/bg_banner_andromedaresonance.png",
        "type": "HKU",
        "description": "3D WaveFunctionCollapse algorithm for Unreal Engine with a mini-game to showcase it.",
        "longdescription": "My graduation project at the University of the Arts Utrecht for my BSc in Game Programming. The project is a 3D WaveFunctionCollapse algorithm for Unreal Engine with a mini-game to showcase it.",
        "work": [
            {
                "title": "Wave Function Collapse",
                "description": "Implemented the Wave Function Collapse algorithm in Unreal Engine in 3D space. This world generation algorithm allows for a very high amount of variety based on local similarity."
            },
            {
                "title": "Drone-Flying",
                "description": "Fly around the generated levels with a drone, showcasing the generated levels."
            },
            {
                "title": "Graduation Papers & Tools",
                "description": "For this project I wrote a paper on the Wave Function Collapse algorithm, and created a tool to generate 3D levels in Unreal Engine. On the side I have created a YouTube tutorial how to create data assets for the Wave Function Collapse algorithm."
            }
        ],
        "tags": [
            "generation",
            "gameplay"
        ],
        "socials": [],
        "videos": [
            {
                "src": "https://youtu.be/7anvESagd90",
                "alt": "V1"
            },
            {
                "src": "https://youtu.be/rkmlyX7Vv3I",
                "alt": "V2"
            }
        ]
    },
    {
        "id": "cat",
        "card": true,
        "title": "Cat Parent",
        "language": "meow-speak",
        "engine": "Real Life",
        "role": "Assistant",
        "duration": "2y+",
        "datetime": "2022",
        "minisrc": "res/bg_mini_cat.png",
        "banner": "res/bg_mini_cat.png",
        "type": "Hobby",
        "description": "The Cats: Finn & Dusty need a lot of attention!",
        "longdescription": "Two Ragdoll Cats; one white, one grey - they are excellent office staff.",
        "work": [
            {
                "title": "Feeding the Cats",
                "description": ""
            },
            {
                "title": "Petting the Cats",
                "description": ""
            },
            {
                "title": "Playing with the Cats",
                "description": ""
            },
            {
                "title": "Cleaning the Litterbox",
                "description": ""
            }
        ],
        "tags": [
            "joy"
        ],
        "socials": [],
        "screenshots": [
            {
                "src": "res/projects/cat/ss_cat_01.png",
                "alt": "S1"
            },
            {
                "src": "res/projects/cat/ss_cat_03.png",
                "alt": "S3"
            },
            {
                "src": "res/projects/cat/ss_cat_04.png",
                "alt": "S4"
            },
            {
                "src": "res/projects/cat/ss_cat_05.png",
                "alt": "S5"
            },
            {
                "src": "res/projects/cat/ss_cat_02.png",
                "alt": "S2"
            }
        ]
    },
    {
        "card": false,
        "title": "Kio",
        "datetime": "2018",
        "engine": "Unreal",
        "language": "C++",
        "description": "Kio is a glassblowing puzzle & adventure game. The goal of the player is to light all glass objects using a variety of glass objects, which you have to glassblow yourself, to deform light into specific directions.",
        "archive": "https://web.archive.org/web/20220528013025/https://jessevanvliet.com/portfolio-kio.php"
    },
    {
        "card": false,
        "title": "StratEgel GameWork",
        "datetime": "2017",
        "engine": "Unreal",
        "language": "C++",
        "description": "GameWork is a framework made by StratEgel B.V in cooporation with Strategis to create socializing gameplay. You have to create an ideal world with various different parties who have their own unique set of goals to achieve.",
        "archive": "https://web.archive.org/web/20190415154046/https://jessevanvliet.com/portfolio-gamework.php"
    },
    {
        "card": false,
        "title": "Hack Stevie",
        "datetime": "2017",
        "engine": "Unity",
        "language": "C#",
        "description": "A game designed for Dutch primary school children in the groups of 7 and 8 to raise awareness for a problem becoming larger and larger. Cybersecurity. During my internship at Flavour we have built this game for 'De week van de Mediawijsheid'. This game is the prequel of 'Hack Shield'.",
        "archive": "https://web.archive.org/web/20190415160215/https://jessevanvliet.com/portfolio-hackstevie.php"
    },
    {
        "card": false,
        "title": "And more...",
        "datetime": "2011-2017",
        "engine": "Unity, Unreal and Custom",
        "language": "Mostly C# and some C++ during this period",
        "description": "Various games for University, hobby Projects and whatnot. Feel free to check out the archived Portfolio page for more information.",
        "archive": "https://web.archive.org/web/20190415154046/https://jessevanvliet.com/index.php"
    }
]